#!/usr/bin/env bash

set -euo pipefail

CHARS=(
	'̀' '́' '̂' '̃' '̄' '̅' '̆' '̇' '̈' '̉' '̊' '̋' '̌' '̍' '̎' '̏' '̐' '̑' '̒' '̓' '̔' '̕' '̖' '̗' '̘' '̙' '̚' '̛' '̜' '̝' '̞' '̟' '̠' '̡' '̢' '̣' '̤' '̥' '̦' '̧' '̨' '̩' '̪' '̫' '̬' '̭' '̮' '̯' '̰' '̱' '̲' '̳' '̴' '̵' '̶' '̷' '̸' '̹' '̺' '̻' '̼' '̽' '̾' '̿' '̀' '́' '͂' '̓' '̈́' 'ͅ' '͆' '͇' '͈' '͉' '͊' '͋' '͌' '͍' '͎' '͏' '͐' '͑' '͒' '͓' '͔' '͕' '͖' '͗' '͘' '͙' '͚' '͛' '͜' '͝' '͞' '͟' '͠' '͡' '͢' 'ͣ' 'ͤ' 'ͥ' 'ͦ' 'ͧ' 'ͨ' 'ͩ' 'ͪ' 'ͫ' 'ͬ' 'ͭ' 'ͮ' 'ͯ'
)
zalgo() {
	IN="$1"
	OUT=""
	for (( i=0; i<${#IN}; i++ )); do
		OUT+="${IN:i:1}"
		OUT+="${CHARS[((RANDOM%${#CHARS[@]}))]}"
	done
	echo "$OUT"
}
zalgo "$(rofi -dmenu -p "Zalgo text" -l 0)" | tr -d '\n' | wl-copy
